{
  "blogs": [
    {
      "title": "Female Army officer caught on camera bathing Corps member with unknown substance in Calabar for allegedly arguing with her",
      "body": "A female Army officer identified as Lt. Chika Viola Anele, has been caught on camera punishing a member of the National Youth Service Corps (NYSC)  Ezeiruaku Ifeyinwa Fidelia in Cross River after having argument Nigerian journalist, Agba Jalingo, who shared the video on Thursday said the incident happened at the 13 Brigade headquarters in Calabar.JusticeForIfenyinwa. This is what a commissioned female Army officer, Lt. Chika Viola Anele, did to a youth corp member, Ezeiruaku Ifeyinwa Fidelia, serving at the 13 Brigade headquarters in Calabar after having an argument. We understand that the leadership in 13 Brigade are working to kill the matter. Let us make the officer very popular for all the wrong reasons. Share the video until it gets to the Chief of Army Staff and that Chika girl is brought to book.",
      "author": "Fatimah",
      "id": 1
    },
    {
      "title": "The knife just missed my heart' - Man says after he was stabbed at McDonald’s by customer angry over not having enough sugar in his coffee",
      "body": "Edmund Pieters has revealed how he came close to dying over a fellow fast-food customer’s out-of-control demand for sugar.   According to Pieters he was quietly having a breakfast  cinnamon rolls and sweet tea at McDonalds in New York City on Tuesday, 21 January. Pieters, 56, a former demolition worker on disability, said that on Tuesday he had just come from a doctor’s appointment on W. 35th St., where he gets his insulin and other medication to treat his diabetes — and stopped at the McDonald’s when he came within an inch of dying.An argument erupted, with another customer angry over there not being enough sugar in his coffee. “He was screaming at the manager, the people in back, everybody,” Pieters, who has two daughters and four grandchildren, told the Daily News.  “He was making a real scene.”“He was arguing about sugar in his coffee,” Pieters said. “Of all things, he wanted four more sugars. He kept going back for sugar. What did he need with like 15 sugars? “He drank the coffee and he’s yelling, ‘I’m not satisfied,’” he said. “And they refunded his money. It couldn’t be more than $1.39. Pieters said the security guard looked frightened.",
      "author": "Fatimah",
      "id": 2
    },
    {
      "title": "This man came from nothing to build everything for his family- Kiddwaya celebrates his dad as they holiday in Greece",
      "body": "This man came from nothing to build everything for his family- Kiddwaya celebrates his dad as they holiday in Greece (photos)\n\n\n\n\nReality TV star, Kiddwaya, and his billionaire dad, Terry Waya, are currently on holiday in Mykonos, Greece.\n\n \n\nKidd shared photos of himself and his dad enjoying their holiday and also praised him. He posted photos on his Instagram page this evening with the caption\n\n \n\n''This man came from NOTHING to build EVERYTHING for his family. Ya’ll wouldn’t understand the blood , sweat and tears he put in. But now I’m starting to understand. I Love you forever pops! ''\n\n ",
      "author": "fatimah",
      "id": 3
    }
  ]
}